# Задание "Слишком древний шифр"

print('Здравствуйте, путешественники! Вам необходимо угадать древний шифр, чтобы не умереть под шипами :)')
print('--------------------------------------------------------------------------------------------------')
print('Основное условие: ')
print('перед Вами появится число от 3 до 20.')
print('Вам нужно написать пары чисел друг за другом, чтобы появившееся число было кратно сумме их значений.')
print('----------------------------------------------------------------------------------------------------')
print('Я помогу Вам отыскать правильный шифр!')
print('--------------------------------------')

n = int(input('Введите число, которое появилось перед Вами: '))

a = [1, 2, 3 ,4 ,5 ,6 ,7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
b = [1, 2, 3 ,4 ,5 ,6 ,7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
pole_2 = []

for i in range(len(a)):
    if n == a[i]:
        continue
    for j in range(a[i], len(b)):
        if a[i] == b[j]:
            continue
        if n == b[j]:
            continue
        if n % (a[i] + b[j]) == 0:
            pole_2.append(a[i])
            pole_2.append(b[j])
        else:
            continue
print(f'А вот и нужный шифр: {pole_2}')

